"use client";

import React from "react";
import { Typography } from "antd";

const { Title, Paragraph } = Typography;

const PersonalDataProcessingAgreement: React.FC = () => {
  return (
    <div style={{ padding: "20px" }}>
      <Title level={2}>Згода на обробку персональних даних</Title>
      <Paragraph>
        Згода на обробку персональних даних Користувач, оформляючи заявку на
        нашому сайті (далі - Сайт), погоджується з умовами цієї Згоди на обробку
        персональних даних (далі - Згода) відповідно до Закону України
        &ldquo;Про захист персональних даних&rdquo;. Прийняттям (акцептом)
        оферти Згоди є відправка заявки з Сайту або замовлення у Оператора за
        телефонами Сайту.
      </Paragraph>
      <Paragraph>
        Користувач дає свою згоду на обробку своїх персональних даних з
        наступними умовами:
        <ol>
          <li>
            Дана Згода дається на обробку персональних даних як без, так і з
            використанням засобів автоматизації.
          </li>
          <li>
            Згода поширюється на наступну інформацію: прізвище, ім&apos;я, по
            батькові, телефон, електронна пошта.
          </li>
          <li>
            Згода на обробку персональних даних дається з метою надання
            Користувачу відповіді на заявку, подальшого укладення та виконання
            зобов&apos;язань за договорами, здійснення клієнтської підтримки,
            інформування про послуги, які, на думку Оператора, можуть
            представляти інтерес для Користувача, проведення опитувань і
            маркетингових досліджень.
          </li>
          <li>
            Користувач, надає Оператору право здійснювати наступні дії
            (операції) з персональними даними: збір, запис, систематизація,
            накопичення, зберігання, уточнення (оновлення, зміну), використання,
            знеособлення, блокування, видалення і знищення, передача третім
            особам, за згодою суб&apos;єкта персональних даних і дотриманням
            заходів, що забезпечують захист персональних даних від
            несанкціонованого доступу.
          </li>
          <li>
            Персональні дані обробляються Оператором до завершення всіх
            необхідних процедур. Також обробка може бути припинена за запитом
            Користувача на електронну пошту: support@vibely.shotiki.fun
          </li>
          <li>
            Користувач підтверджує, що, даючи Згоду, він діє вільно, своєю волею
            і в своєму інтересі.
          </li>
          <li>
            Справжня Згода діє безстроково до моменту припинення обробки
            персональних даних з підстав, зазначених у п.6 даного документа.
          </li>
        </ol>
      </Paragraph>
    </div>
  );
};

export default PersonalDataProcessingAgreement;
