"use client";

import React from "react";
import { Typography } from "antd";

const { Title, Paragraph } = Typography;

const ReturnExchangePolicy: React.FC = () => {
  return (
    <div style={{ padding: "20px" }}>
      <Title level={2}>Умови повернення та обміну</Title>
      <Paragraph>
        Товар, замовлений в нашому Інтернет магазині, ви можете повернути
        (обміняти) протягом 14 днів, не рахуючи дня покупки, відповідно до
        закону України &ldquo;Про захист прав споживача&rdquo;, якщо цей товар
        не потрапляє до переліку товарів належної якості, що не підлягають
        обміну (поверненню) згідно Постанови Кабінету Міністрів України №172.
      </Paragraph>
      <Paragraph>
        Обов&apos;язкові умови для повернення або обміну товару:
        <ul>
          <li>Товар повинен бути повністю укомплектований</li>
          <li>Наявність оригінальної і неушкодженої упаковки і ярликів</li>
          <li>
            Дотримання товарного вигляду (відсутність слідів експлуатації і
            шкарпетки)
          </li>
        </ul>
      </Paragraph>
      <Paragraph>
        Перед тим, як повернути товар, необхідно обов&apos;язково
        зв&apos;язатися з менеджером для оформлення заявки на повернення.
        Повернення здійснюється по Новій пошті.
      </Paragraph>
      <Paragraph>
        Зверніть увагу:
        <ul>
          <li>
            У разі повернення товару неналежної якості, магазин бере на себе
            витрати на пересилку. Для цього, необхідно надати чек за пересилку
            товару.
          </li>
          <li>
            Якщо присланий товар не підлягає поверненню, магазин змушений
            відправити його назад за рахунок покупця.
          </li>
          <li>
            Повернення грошових коштів, в разі відправлення товару через Нову
            пошту, здійснюється на розрахунковий рахунок покупця.
          </li>
          <li>
            Якщо товар не працює (пошкоджений), обмін або повернення товару
            можливий тільки за наявності висновку сервісного центру,
            авторизованого виробником, про те, що умови експлуатації не
            порушені.
          </li>
        </ul>
      </Paragraph>
    </div>
  );
};

export default ReturnExchangePolicy;
